// =============================================================================
// Рекурсивная функция
// =============================================================================
function factorial(n) {
  // 1. Простейший случай
  // 1.1. Если число "n" === 1
  if (n === 1) {
    // 1.2. Вернуть само число
    return n;
  }
  
  // 2. Сложный случай
  // 2.1. Вызвать функцию с числом на 1 меньше
  // 2.2. Результат вызова умножить на "n"
  return n * factorial(n - 1);
}



// =============================================================================
// Вызов функции
// =============================================================================
console.log( factorial(1) );
console.log( factorial(2) );
console.log( factorial(3) );
console.log( factorial(4) );
console.log( factorial(5) );