// =============================================================================
// Рекурсивная функция
// =============================================================================
const power = (x, n) => {
  // 1. Простейший случай
  // 1.1. Если степень "n" === 1 (то есть, "x" умножатся на 1)
  if (n === 1) {
    // 1.2. Вернуть само значение "x"
    return x;
  }
  
  // 2. Сложный случай
  // 2.1. Вызвать функцию со степенью на 1 меньше
  // 2.2. Результат вызова умножить на "x"
  return x * power(x, n - 1);
}



// =============================================================================
// Примеры возведения числа в разные степени
// =============================================================================
console.log( "power(2, 2):", power(2, 2) );
console.log( "power(2, 3):", power(2, 3) );
console.log( "power(2, 4):", power(2, 4) );
console.log( "power(2, 5):", power(2, 5) );
console.log( "power(2, 6):", power(2, 6) );
console.log( "power(2, 7):", power(2, 7) );
console.log( "power(2, 8):", power(2, 8) );
console.log( "power(2, 9):", power(2, 9) );
console.log( "power(2, 10):", power(2, 10) );