// ===========================================================================
// Среднее арифметическое из массива чисел
// ===========================================================================
// Источник: https://stackoverflow.com/a/52139743/4956416
export function arithmeticMean(array) {
  return array.reduce((avg, value, _, array) => avg + value / array.length, 0);
}


// ===========================================================================
// Группировка значений массива в объекте
// ===========================================================================
export function groupValues(array) {
  return array.reduce((accum, value) => ({
    // Spread-оператор (достать свойства объекта)
    ...accum,
    // Добавить новое свойство или перезаписать существующее свойство,
    // ...название которого содержится в переменной "value"
    // Значение — текущее значение (если свойство уже есть) или "0"
    // Прибавить к свойству "1"
    [value]: (accum[value] || 0) + 1,
  }))
}