// =============================================================================
// Рекурсивная функция
// =============================================================================
function func(n) {
  // 1. Простейший случай
  // 1.1. Если: ....
  if (n === 0) return 0;
  
  // 2. Сложный случай
  // 2.1. Если: все остальные случаи
  // 2.1. Вызвать функцию, передав...
  // 2.2. Вернуть результат вызова...
  return func(n - 1);
}



// =============================================================================
// Примеры вызова функции
// =============================================================================
console.log( func(1) );